app/views/collections/_collection_restaurants_list.html.erb

    <tbody>
    <% @collection.restaurants.each do |cr| %>
---
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `collection_restaurants` ON `restaurants`.`id` = `collection_restaurants`.`restaurant_id` WHERE `collection_restaurants`.`collection_id` = 5 AND `restaurants`.`id` = 1 LIMIT 1