app/views/pages/home.html.slim

SELECT `filters`.* FROM `filters` WHERE (code = 'cuisine') ORDER BY name ASC
---
        .home_search
          = select("filter_ids",nil, @cuisine.collect {|p| [ p.name, "#{p.id},#{p.filter_type_id}" ] }, { include_blank: false },class: 'select_cuisine')