app/views/restaurants/_upload_menu.html.erb

SELECT `menus`.* FROM `menus` WHERE `menus`.`restaurant_id` = 1057
---
    <tbody>
      <% @restaurant.menus.each do |m| %>