app/controllers/collection_images_controller.rb

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 0 LIMIT 1
---
  def create
    p_attr = params[:collection_image]
    collection_id = params[:collection_image][:collection_id]
    p_attr[:image] = params[:collection_image][:image].first if params[:collection_image][:image].class == Array
    collection = Collection.find(collection_id) if collection_id