app/controllers/collections_controller.rb

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`disabled` = 0
---
  def admin_new_collection
    @collection = Collection.new
    @restaurants = Restaurant.where(disabled: false)

SELECT `collections`.* FROM `collections` WHERE `collections`.`name` = 'test' LIMIT 1
INSERT INTO `collection_images` (`collection_id`, `created_at`, `image_name`, `image_uid`, `text_content`, `text_hyperlink`, `text_title`, `updated_at`) VALUES (12, '2016-01-17 01:55:51', '--- !ruby/object:ActionDispatch::Http::UploadedFile\noriginal_filename: sunday_roast.png\ncontent_type: image/png\nheaders: \"Content-Disposition: form-data; name=\\\"collection_image[image_name]\\\"; filename=\\\"sunday_roast.png\\\"\\r\\nContent-Type:\n image/png\\r\\n\"\ntempfile: !ruby/marshalable:Tempfile\n :__v2__:\n - :@data\n - :@clean_proc\n - :@tmpfile\n - :@tmpname\n - :@mode\n - :@opts\n ? - &1\n - \"/var/folders/rf/q4l8n5k56pnbjgkdtzrhq_w00000gn/T/RackMultipart20160117-28026-ubldkt\"\n - &2 !ruby/object:File {}\n - !ruby/object:Tempfile::Remover\n pid: 28026\n data: *1\n - *2\n - \"/var/folders/rf/q4l8n5k56pnbjgkdtzrhq_w00000gn/T/RackMultipart20160117-28026-ubldkt\"\n - 2\n - :perm: 384\n : *2\n', NULL, NULL, NULL, NULL, '2016-01-17 01:55:51')
INSERT INTO `collections` (`created_at`, `description`, `image_url`, `name`, `updated_at`) VALUES ('2016-01-16 19:33:32', 'testst', '--- !ruby/object:ActionDispatch::Http::UploadedFile\noriginal_filename: steak.png\ncontent_type: image/png\nheaders: \"Content-Disposition: form-data; name=\\\"collection[image_url]\\\"; filename=\\\"steak.png\\\"\\r\\nContent-Type:\n image/png\\r\\n\"\ntempfile: !ruby/marshalable:Tempfile\n :__v2__:\n - :@data\n - :@clean_proc\n - :@tmpfile\n - :@tmpname\n - :@mode\n - :@opts\n ? - &1\n - \"/var/folders/rf/q4l8n5k56pnbjgkdtzrhq_w00000gn/T/RackMultipart20160116-27879-372yeq\"\n - &2 !ruby/object:File {}\n - !ruby/object:Tempfile::Remover\n pid: 27879\n data: *1\n - *2\n - \"/var/folders/rf/q4l8n5k56pnbjgkdtzrhq_w00000gn/T/RackMultipart20160116-27879-372yeq\"\n - 2\n - :perm: 384\n : *2\n', 'test', '2016-01-16 19:33:32')
---
  def create
    if params[:admin] == 'true'

    end

    @collection = Collection.where(name: params[:collection][:name]).first
    respond_to do |format|
      if @collection.blank?
        @collection = Collection.new(params[:collection])
        if params[:collection_image]
          @collection.collection_image = CollectionImage.new(params[:collection_image])
        end
        if @collection.save

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 1 LIMIT 1
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`disabled` = 0
---
  def edit_collection
    @collection = Collection.find(params[:id])
    @restaurants = Restaurant.where(disabled: false)

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 1 LIMIT 1
SELECT `collection_images`.* FROM `collection_images` WHERE `collection_images`.`collection_id` = 25 LIMIT 1
INSERT INTO `collection_images` (`collection_id`, `created_at`, `image_name`, `image_uid`, `text_content`, `text_hyperlink`, `text_title`, `updated_at`) VALUES (6, '2016-01-18 16:32:16', 'steak.png', '2016/01/18/17_32_16_630_steak.png', NULL, NULL, NULL, '2016-01-18 16:32:16')
UPDATE `collection_images` SET `image_uid` = '2016/01/17/05_02_19_831_persian.png', `image_name` = 'persian.png', `updated_at` = '2016-01-17 04:02:19' WHERE `collection_images`.`id` = 6
UPDATE `collections` SET `image_url` = 'http://localhost:3000/media/W1siZiIsIjIwMTYvMDEvMTkvMTRfMDFfNDNfNTk3X2JyZWFrZmFzdC5wbmciXSxbInAiLCJ0aHVtYiIsIjE2MHgxNjAjIl1d/breakfast.png', `updated_at` = '2016-01-19 13:01:43' WHERE `collections`.`id` = 3
---
  def update
    check_params(params)
    @collection = Collection.find(params[:id])
    if params[:collection_image]
      # @collection_image = CollectionImage.new(params[:collection_image])
      if @collection.collection_image.blank?
        @collection.collection_image = CollectionImage.new(params[:collection_image])
        @collection.collection_image.save

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 2 LIMIT 1
---
  def disable_toggle
    @collection = Collection.find(params[:id])

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 2 LIMIT 1
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
INSERT INTO `collection_restaurants` (`collection_id`, `order`, `restaurant_id`) VALUES (NULL, NULL, NULL)
SELECT 1 AS one FROM `restaurants` INNER JOIN `collection_restaurants` ON `restaurants`.`id` = `collection_restaurants`.`restaurant_id` WHERE `collection_restaurants`.`collection_id` = 5 AND `restaurants`.`id` = 1 LIMIT 1
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `collection_restaurants` ON `restaurants`.`id` = `collection_restaurants`.`restaurant_id` WHERE `collection_restaurants`.`collection_id` = 2 AND `restaurants`.`id` = 1 LIMIT 1
---
  def add_restaurant
    status = 'failed'
    tr = 'collections.update_failed'
    #respond_to do |format|
      if params[:collection_restaurant][:restaurant_id].present?
        restaurant_id = params[:collection_restaurant][:restaurant_id];
        @collection = Collection.find(params[:id])
        restaurant = Restaurant.find(restaurant_id)

        @collection.restaurants << restaurant unless @collection.restaurants.include?(restaurant)

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 2 LIMIT 1
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `collection_restaurants` ON `restaurants`.`id` = `collection_restaurants`.`restaurant_id` WHERE `collection_restaurants`.`collection_id` = 2 AND `restaurants`.`id` = 1 LIMIT 1
DELETE FROM `collection_restaurants` WHERE `collection_restaurants`.`collection_id` = 2 AND `collection_restaurants`.`restaurant_id` IN (1)
---
  def remove_restaurant
    @status = 'failed'
    tr = 'collections.update_failed'
    @collection = Collection.find(params[:id])
    if @collection.present?
      if params[:restaurant_id].present?
        @restaurant_id = params[:restaurant_id]
        restaurant = @collection.restaurants.find(@restaurant_id)
        if restaurant
          @collection.restaurants.delete(restaurant)

SELECT `collections`.* FROM `collections` WHERE `collections`.`id` = 28 LIMIT 1
DELETE FROM `collections` WHERE `collections`.`id` = 28
---
  def destroy
    @collection = Collection.find(params[:id])
    @collection.destroy