app/controllers/menus_controller.rb

INSERT INTO `menus` (`created_at`, `menu_name`, `menu_uid`, `name`, `restaurant_id`, `updated_at`, `user_id`) VALUES ('2016-01-16 16:51:35', 'chinese.png', '2016/01/16/17_51_35_128_chinese.png', '', NULL, '2016-01-16 16:51:35', 1)
---
  def create
    @menu = Menu.new(params[:menus])
    @menu.user_id = current_user.id

    respond_to do |format|
      if @menu.save

SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 80 LIMIT 1
DELETE FROM `menus` WHERE `menus`.`id` = 80
---
  def destroy
    @menu = Menu.find(params[:id])
    @menu.destroy