app/controllers/pages_controller.rb

  def home
    @admin_photo = AdminPhoto.ramdom_photo
    cuisine = Filter.cuisine.order("name ASC")
---
SELECT `filters`.* FROM `filters` WHERE (code = 'cuisine') ORDER BY name ASC