app/controllers/photos_controller.rb

  def index
    @restaurant = Restaurant.find(params[:r_id])
    @photos = @restaurant.photos
    render :json => @photos.collect { |p| p.to_jq_upload }.to_json
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 0 LIMIT 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`restaurant_id` = 1057

  def create
    p_attr = params[:photo]
    restaurant_id = params[:photo][:restaurant_id]
    p_attr[:image] = params[:photo][:image].first if params[:photo][:image].class == Array
    restaurant = Restaurant.find(restaurant_id) if restaurant_id

    @photo = Photo.new(p_attr)
    if @photo.save
      restaurant.update_attribute('updated_at', Time.now) if restaurant
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 0 LIMIT 1
INSERT INTO `photos` (`cover`, `created_at`, `image_name`, `image_uid`, `restaurant_id`, `restaurant_temp_id`, `status`, `text_content`, `text_hyperlink`, `text_title`, `updated_at`, `user_id`) VALUES (0, '2016-01-16 20:52:56', 'michelin.png', '2016/01/16/21_52_56_140_michelin.png', 1057, NULL, 0, NULL, NULL, NULL, '2016-01-16 20:52:56', 1)
UPDATE `restaurants` SET `request_approve_photo` = 1, `updated_at` = '2016-01-16 20:52:56' WHERE `restaurants`.`id` = 1057

  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 535 LIMIT 1
DELETE FROM `photos` WHERE `photos`.`id` = 535

  def to_cover
    @photo = Photo.find(params[:id])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 535 LIMIT 1