app/controllers/restaurants_controller.rb

  def show
    @page = params[:page] || 1
    @per_page = REVIEW_PER_PAGE
    @restaurant = Restaurant.find(params[:id])
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 0 LIMIT 1

  def edit
    @restaurant = Restaurant.find(params[:id])

    if @restaurant.schedules.blank?
      (1..7).each {|i| @restaurant.schedules.build(day_of_week: i)}
    elsif @restaurant.schedules.is_daily.blank?
      (1..7).each {|i| @restaurant.schedules.build(day_of_week: i, schedule_type: 'daily')}
    elsif @restaurant.schedules.is_evening.blank?
      (1..7).each {|i| @restaurant.schedules.build(day_of_week: i, schedule_type: 'evening')}
    end
    @restaurant.photos.build if @restaurant.photos.blank?
    cuisine = @restaurant.filters.where(code: 'cuisine')
    @filter_cuisine_id = []
    if cuisine.length > 0
      cuisine.each do |c| @filter_cuisine_id << c.id end
    end

    @menu = Menu.new(restaurant_id: @restaurant.id)
    @filter_ids = @restaurant.filter_ids

    filter_type_hal_status = FilterType.where(code: 'hal_status').first
    @filter_status = filter_type_hal_status.filters if filter_type_hal_status

    # filter_type_facilities = FilterType.where(code: 'facility').first
    # @filter_facilities = filter_type_facilities.filters if filter_type_facilities

    filter_type_price = FilterType.where(code: 'price').first
    @filter_prices = filter_type_price.filters if filter_type_price

    filter_type_cuisine = FilterType.where(code: 'cuisine').first
    @filter_cuisines = filter_type_cuisine.filters.order('name ASC') if filter_type_cuisine
---
SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`restaurant_id` = 1057 ORDER BY day_of_week ASC
SELECT `photos`.* FROM `photos` WHERE `photos`.`restaurant_id` = 1057
SELECT `filters`.* FROM `filters` INNER JOIN `filters_restaurants` ON `filters`.`id` = `filters_restaurants`.`filter_id` WHERE `filters_restaurants`.`restaurant_id` = 1057 AND `filters`.`code` = 'cuisine'
SELECT `filters`.id FROM `filters` INNER JOIN `filters_restaurants` ON `filters`.`id` = `filters_restaurants`.`filter_id` WHERE `filters_restaurants`.`restaurant_id` = 1057
SELECT `filter_types`.* FROM `filter_types` WHERE `filter_types`.`code` = 'hal_status' LIMIT 1
SELECT `filters`.* FROM `filters` WHERE `filters`.`filter_type_id` = 1 ORDER BY name ASC

    # @filter_organic = filter_type_organic.filters if filter_type_organic

    filter_type_features = FilterType.where(code: 'features').first
    @filter_features = filter_type_features.filters.where_not_offer if filter_type_features
---
SELECT `filters`.* FROM `filters` WHERE `filters`.`filter_type_id` = 11 AND (code != 'offer')