app/controllers/reviews_controller.rb

  def index
    @search = Review.search(params[:q])
    if params[:commit].blank? && params[:q].blank?
      @reviews = Review.order("created_at DESC").page(params[:page]).per(PER_PAGE)
---
SELECT COUNT(*) FROM `reviews`
SELECT `reviews`.* FROM `reviews` ORDER BY created_at DESC LIMIT 30 OFFSET 0