app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 12 OFFSET 0
---
  def index
    @search = User.search(params[:q])
    @users = @search.result.page(params[:page])